---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConstructionName
source: html/cd8ef445-ddcb-918b-ef4a-667ffb954ba2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConstructionName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ConstructionName { get; }
```